openFoamRepoDev/tutorials/incompressible/icoFoam/cavityMappingTest/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication -s coarse blockMesh -dict system/blockMeshDict.coarse

mkdir constant/coarseMesh
mv -f constant/polyMesh constant/coarseMesh

runApplication -s fine blockMesh -dict system/blockMeshDict.fine

runApplication $(getApplication)

#------------------------------------------------------------------------------
